Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::TakeOffDefault Class Referencefinal
MEP Element Manager
The TakeOffDefault contains the necessary non-geometric data for creating a Take-off element. More...
#include <MEPTakeOffDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::TakeOffDefault:
 Public Member Functions
Result< UniqueID >  | Place (const UniqueID &associatedSegmentId, const double distanceFromBeginning, const double rotationAroundMainAxis=0.0, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places an Take-off element on the given segment based on this Default.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
Result< Domain >  | GetDomainOfPort (uint32_t portIndex) const
Result< VentilationPortDefault >  | GetVentilationPortDefault (uint32_t portIndex) const
Result< PipingPortDefault >  | GetPipingPortDefault (uint32_t portIndex) const
Result< CableCarrierPortDefault >  | GetCableCarrierPortDefault (uint32_t portIndex) const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Public Member Functions inherited from ACAPI::v1::ElementDefault
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< TakeOffDefault >  | CreateTakeOffDefault (Domain)
Creates a TakeOffDefault.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Constructs an ElementDefault with the given element default implementation.
Modifier (ElementDefault &parent)
Constructs a Modifier with the given parent ElementDefault.
 Protected Member Functions inherited from ACAPI::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The TakeOffDefault contains the necessary non-geometric data for creating a Take-off element.
Since
Archicad 28
Example code snippet from Test / New MEP
Placement
 // First, we create a simple route to place the Take-Off on. For more details, see RoutingElement-Placement-Example.
 ACAPI::Result<RoutingElementDefault> routingElementDefault = CreateRoutingElementDefault (Domain::Ventilation);
 if (routingElementDefault.IsErr ()) {
 return routingElementDefault.UnwrapErr ().kind;
 }
 // Place a route consisting of a single, 10-meter-long segment facing north
 std::map<UInt32, ACAPI::MEP::RoutingSegmentRectangularCrossSectionData> rectangularCrossSectionData;
 std::map<UInt32, ACAPI::MEP::RoutingSegmentCircularCrossSectionData> circularCrossSectionData;
 ACAPI::Result<UniqueID> routingElemId = routingElementDefault->Place ({ {10.0, 30.0, 0.0}, {10.0, 25.0, 0.0} }, rectangularCrossSectionData, circularCrossSectionData);
 if (routingElemId.IsErr ()) {
 return routingElemId.UnwrapErr ().kind;
 }
 // Retrieve the routing element so we can access its segments
 const ACAPI::Result<RoutingElement> routingElement = RoutingElement::Get (*routingElemId);
 if (routingElement.IsErr ()) {
 return routingElement.UnwrapErr ().kind;
 }
 // Retrieve the IDs of the segments of the routing element
 const std::vector<UniqueID> segmentIds = routingElement->GetRoutingSegmentIds ();
 if (segmentIds.empty ()) {
 return Error;
 }
 // Prepare the Take-off default
 ACAPI::Result<TakeOffDefault> takeOffDefault = CreateTakeOffDefault (Domain::Ventilation);
 if (takeOffDefault.IsErr ()) {
 return takeOffDefault.UnwrapErr ().kind;
 }
 // Place a Take-off near the beginning of the first route segment, which will face left relative to the segment direction
 ACAPI::Result<UniqueID> takeOffLeftId = takeOffDefault->Place (segmentIds[0], 1.25);
 if (takeOffLeftId.IsErr ()) {
 return takeOffLeftId.UnwrapErr ().kind;
 }
 // Place a Take-off near the end of the first route segment, which will face up
 ACAPI::Result<UniqueID> takeOffUpId = takeOffDefault->Place (segmentIds[0], 2.5, PI*0.5);
 if (takeOffUpId.IsErr ()) {
 return takeOffUpId.UnwrapErr ().kind;
 }
 // Place a Take-off near the end of the first route segment, which will face right relative to the segment direction
 ACAPI::Result<UniqueID> takeOffRightId = takeOffDefault->Place (segmentIds[0], 3.75, PI);
 if (takeOffRightId.IsErr ()) {
 return takeOffRightId.UnwrapErr ().kind;
 }
 Modification
 ACAPI::Result<Element> mepElem = Element::Get (takeOffId);
 if (mepElem.IsErr ()) {
 ACAPI_WriteReport (mepElem.UnwrapErr ().text.c_str (), false);
 return mepElem.UnwrapErr ().kind;
 }
 // We can modify the Shape, Width or Height of the take-off by modifying its first port
 ACAPI::Result<Port> mainPort = Port::Get (mepElem->GetPortIDs ().front ());
 ACAPI::Result<void> modifyPortResult = (*mainPort).Modify ([](Port::Modifier& modifier) {
 modifier.SetShape (ConnectorShape::Circular);
 modifier.SetWidth (0.2);
 }, "Take-off Port properties modified.");
 if (modifyPortResult.IsErr ())
 return modifyPortResult.UnwrapErr ().kind;
 // We can modify the Length of the take-off by modifying the take-off directly
 ACAPI::Result<TakeOff> takeOff = TakeOff::Get (takeOffId);
 if (takeOff.IsErr ()) {
 ACAPI_WriteReport (takeOff.UnwrapErr ().text.c_str (), false);
 return takeOff.UnwrapErr ().kind;
 }
 ACAPI::Result<void> modifyTakeOffResult = (*takeOff).Modify ([] (TakeOff::Modifier& modifier)
 {
 modifier.SetLength (1.0);
 }, "Take-off properties modified.");
 if (modifyTakeOffResult.IsErr ())
 return modifyTakeOffResult.UnwrapErr ().kind;
Member Function Documentation
◆ Place()
 Result< UniqueID > ACAPI::MEP::v1::TakeOffDefault::Place  |  ( |  const UniqueID &  |  associatedSegmentId,
|  const double  |  distanceFromBeginning,
|  const double  |  rotationAroundMainAxis = 0.0,
|  const std::optional< API_Guid > &  |  requiredId = std::nullopt
) |   |  const
Places an Take-off element on the given segment based on this Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several RoutingElements and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created RoutingElement and/or MEP element, therefore the performance should be improved.
Parameters
associatedSegmentId | The UniqueID representing the RoutingSegment on which the Take-off will be placed
distanceFromBeginning | The distance along the segment where the Take-off will be placed, measured from the beginning coordinate of the associated segment
rotationAroundMainAxis | The rotation of the Take-off with the associated segment's direction vector as an axis - optional parameter, the default value of 0.0 will place the Take-off facing left relative to the segment's direction
requiredId | The guid to be set for the Take-off - optional parameter
Returns
If executed with success, returns the newly placed Take-off's uniqueId, otherwise Error.
Friends And Related Symbol Documentation
◆ CreateTakeOffDefault
 Result< TakeOffDefault > CreateTakeOffDefault  |  ( |  Domain  |  domain | )
friend
Creates a TakeOffDefault.
Parameters
domain | The domain of the requested TakeOffDefault. Currently it can only be ventilation.
Returns
If able, returns a copy of Archicad's current Default of the TakeOff tool for the domain defined by the parameter, otherwise Error (for ex. if domain is cable carrier).